def quicksort(array):
    if len(array) < 2:
#-------------------------------------------------------------
##基线条件，为空或者只包含一个元素的数组是有序的
        return array
    else:
#--------------------------------------------------------------
##递归条件
        pivot = array[0]
#--------------------------------------------------------------
##由所有小于等于基准值的元素组成的子数组   
        less = [i for i in array[1:] if i <= pivot]
#--------------------------------------------------------------
##由所有大于基准值的元素组成的子数组
        greater = [i for i in array[1] if i > pivot]
        return quicksort((less) +[pivot] + quicksort(greater))

print (quicksort ([10, 2 ,5, 3]))
